Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: The raw un-transformed position of the current vertex.
pt_br: A posição crua, não transformada, do vértice atual.

source: Creates a new [[PixelEffect]].
pt_br: Cria um novo [[PixelEffect (Português)|EfeitoDePixel]].

source: fused
pt_br: fundido

source: It's possible to rotate an object about its center by offsetting the origin to the center.
pt_br: É possível girar um objeto em torno de seu centro deslocando a origem para o centro.

source: Draw text to the screen with right alignment and a horizontal limit of 125.
pt_br: Desenhar texto na tela com alinhamento à direita e limite horizontal de 125.

source: The desired height of the framebuffer.
pt_br: A altura desejada para o framebuffer.

source: pixeleffect = love.graphics.newPixelEffect( code )
pt_br: efeitodepixel = love.graphics.newPixelEffect( codigo )

source: Creates a new FontData.
pt_br: Cria um novo DadoDeFonte.

source: Draws a rectangle.
pt_br: Desenha um retângulo.

source: love.graphics.setLineJoin( join )
pt_br: love.graphics.setLineJoin( juncao )

source: function love.draw() love.graphics.setColor(0, 255, 0, 255) love.graphics.print("This is a pretty lame example.", 10, 200) love.graphics.setColor(255, 0, 0, 255) love.graphics.print("This lame example is twice as big.", 10, 250, 0, 2, 2) love.graphics.setColor(0, 0, 255, 255) love.graphics.print("This example is lamely vertical.", 300, 30, math.pi/2) end
pt_br: function love.draw() love.graphics.setColor(0, 255, 0, 255) love.graphics.print("Este é um exemplo bem tosco.", 10, 200) love.graphics.setColor(255, 0, 0, 255) love.graphics.print("Este exemplo tosco tem o dobro do tamanho.", 10, 250, 0, 2, 2) love.graphics.setColor(0, 0, 255, 255) love.graphics.print("Este exemplo é toscamente vertical.", 300, 30, math.pi/2) end

source: Provides an interface to output sound to the user's speakers.
pt_br: Provê uma interface para criar sons com os alto-falantes do usuário.

source: Creates a new [[Image]] from a filepath, [[FileData]] or an [[ImageData]].
pt_br: Cria uma nova [[Image (Português)|Imagem]] a partir de um caminho de arquivo, [[FileData (Português)|DadoDeArquivo]] ou [[ImageData (Português)|DadoDeImagem]].

source: SoundData
pt_br: DadoDeSom

source: The size of the font in pixels.
pt_br: O tamanho da fonte, em pixels.

source: * [[love.filesystem.write]]
pt_br: * [[love.filesystem.write (Português)|love.filesystem.write]]

source: Gets the size in bytes of a file.
pt_br: Obtém o tamanho de um arquivo em bytes.

source: Sets the color used for drawing.
pt_br: Configura a cor a ser utilizada para desenhar.

source: love.graphics.setColorMode( mode )
pt_br: love.graphics.setColorMode( modo )

source: The effect language is basically [http://www.opengl.org/sdk/docs/manglsl/ GLSL 1.20] ([http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf specs]) with a few aliases added for existing types:
pt_br: A linguagem de efeitos é basicamente [http://www.opengl.org/sdk/docs/manglsl/ GLSL 1.20] ([http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf especificações]) com alguns nomes alternativos adicionados para os tipos existentes:

source: Exits the LÖVE program.
pt_br: Sai do programa LÖVE.

source: Pixel Shader Function
pt_br: Função do Shader de Pixel

source: The desired width of the Canvas.
pt_br: A largura desejada para a Pintura.

source: Vertex shader code is run for every vertex drawn to the screen (for example, love.graphics.rectangle will produce 4 vertices) and is used to transform the vertex positions from their original coordinates into screen-space, as well as to send information such as per-vertex color and texture coordinate values to the pixel shader.
pt_br: O código do shader de vértice roda uma vez para cada vértice desenhado na tela (por exemplo, love.graphics.rectangle produzirá 4 vértices) e é usado para transformar as posições dos vértices de suas coordenadas originais para o espaço da tela, além de mandar informações como a cor de cada vértice e valores de coordenada de textura para o shader de pixel.

source: PixelEffect
pt_br: EfeitoDePixel

source: myStencilFunction = function() love.graphics.circle("fill", 400, 300, 60, 25) end love.graphics.setStencil(myStencilFunction) love.graphics.setColor(155, 0, 128) love.graphics.polygon("fill", 400, 200, 486, 350, 314, 350) love.graphics.setInvertedStencil(myStencilFunction) love.graphics.setColor(144, 214, 128) love.graphics.polygon("fill", 400, 200, 486, 350, 314, 350)
pt_br: minhaFuncaoEstencil = function() love.graphics.circle("fill", 400, 300, 60, 25) end love.graphics.setStencil(minhaFuncaoEstencil) love.graphics.setColor(155, 0, 128) love.graphics.polygon("fill", 400, 200, 486, 350, 314, 350) love.graphics.setInvertedStencil(minhaFuncaoEstencil) love.graphics.setColor(144, 214, 128) love.graphics.polygon("fill", 400, 200, 486, 350, 314, 350)

source: size = love.graphics.getMaxPointSize( )
pt_br: tamanho = love.graphics.getMaxPointSize( )

source: * [[love.graphics.getCanvas]]
pt_br: * [[love.graphics.getCanvas (Português)|love.graphics.getCanvas]]

source: * [[love.graphics.shear]]
pt_br: * [[love.graphics.shear (Português)|love.graphics.shear]]

source: The new File object, or nil if an error occurred.
pt_br: O novo objeto Arquivo, ou nil, se ocorrer um erro.

source: function love.load() hamster = love.graphics.newImage("hamster.png") width = hamster:getWidth() height = hamster:getHeight() end function love.draw() love.graphics.draw(hamster, 100, 100, math.rad(90), 1, 1, width / 2, height / 2) end
pt_br: function love.load() hamster = love.graphics.newImage("hamster.png") largura = hamster:getWidth() altura = hamster:getHeight() end function love.draw() love.graphics.draw(hamster, 100, 100, math.rad(90), 1, 1, largura / 2, altura / 2) end

source: myStencil = love.graphics.newStencil( stencilFunction )
pt_br: meuEstencil = love.graphics.newStencil( funcaoEstencil )

source: love.graphics.rectangle( mode, x, y, width, height )
pt_br: love.graphics.rectangle( modo, x, y, largura, altura )

source: Like love.event.poll(), but blocks until there is an event in the queue.
pt_br: Como love.event.poll(), mas bloqueia a execução até existir um evento na fila.

source: * [[PixelEffect]]
pt_br: * [[PixelEffect (Português)|EfeitoDePixel]]

source: modtime, errormsg = love.filesystem.getLastModified( filename )
pt_br: horamod, msgerro = love.filesystem.getLastModified( nomeDoArquivo )

source: True if the directory was created, false if not.
pt_br: Verdadeiro se o diretório for criado, senão, falso.

source: The max supported point size.
pt_br: O tamanho máximo de ponto suportado.

source: Filter mode used when scaling the image down.
pt_br: Modo de filtragem usado ao reduzir a imagem.

source: True if the archive was successfully mounted, false otherwise.
pt_br: Verdadeiro se o arquivo tiver sido montado com sucesso, senão, falso.

source: love.graphics.setFont( filename, size )
pt_br: love.graphics.setFont( nomeDoArquivo, tamanho )

source: Simple Example
pt_br: Exemplo Simples

source: The returned number depends on the system running the code.
pt_br: O número retornado vai depender do sistema rodando o código.

source: Creates a new [[Canvas]] object for offscreen rendering.
pt_br: Cria um novo objeto [[Canvas (Português)|Pintura]] para renderização fora da tela.

source: Gets whether wireframe mode is used when drawing.
pt_br: Descobre se o modo de estrutura de arame está sendo usado ao desenhar.

source: Additionally, the supported maximum number of fsaa samples varies depending on the system.
pt_br: Além disso, o número máximo suportado de amostras de fsaa varia dependendo do sistema.

source: Creates a screenshot and returns the [[ImageData]].
pt_br: Cria uma captura e retorna o [[ImageData (Português)|DadoDeImagem]].

source: All scaling, shearing, and rotation arguments transform the object relative to that point.
pt_br: Todos os argumentos de tamanho, inclinação e rotação transformam o objeto em relação a esse ponto.

source: The filepath to the image file (or a FileData or ImageData or CompressedData object.)
pt_br: O caminho para um arquivo de imagem (ou um DadoDeArquivo, ou DadoDeImagem ou DadoComprimido.)

source: The Image to use for the sprites.
pt_br: A imagem a ser usada nos sprites.

source: The final transformed position of the current vertex.
pt_br: A posição transformada final do vértice atual.

source: width
pt_br: largura

source: ImageData
pt_br: DadoDeImagem

source: name = love.filesystem.getIdentity( )
pt_br: nome = love.filesystem.getIdentity( )

source: The GlyphData.
pt_br: O DadoDeGlifo.

source: screenshot = love.graphics.newScreenshot( )
pt_br: captura = love.graphics.newScreenshot( )

source: A text string.
pt_br: O string de texto.

source: This can bite you if you are appending keystrokes to form your string, as some of those are multi-byte unicode characters which will likely contain null bytes.
pt_br: Isso pode dar problemas se você for acrescentar texto digitado pelo usuário para formar seu string, já que alguns desses caracteres serão unicode multibyte, provavelmente contendo bytes nulos.

source: Additional Information
pt_br: Informações Adicionais

source: * [[ love.font]]
pt_br: * [[ love.font (Português)|love.font]]

source: and if you want to handle OS-generated events at all (think callbacks).
pt_br: e é necessária para lidar com eventos gerados pelo sistema operacional (isso é, callbacks).

source: The ImageData object to create the font from.
pt_br: O objeto DadoDeImagem a partir do qual se deve criar a fonte.

source: Provides an interface to the user's filesystem.
pt_br: Provê uma interface para o sistema de arquivos do usuário.

source: image = love.graphics.newImage( filename, format )
pt_br: imagem = love.graphics.newImage( nomeDoArquivo, formato )

source: The current PixelEffect.
pt_br: O EfeitoDePixel atual.

source: The new point style.
pt_br: O novo estilo de ponto.

source: * [[love.graphics.present]]
pt_br: * [[love.graphics.present (Português)|love.graphics.present]]

source: canvas
pt_br: pintura

source: * [[love.graphics.getDefaultImageFilter]]
pt_br: * [[love.graphics.getDefaultImageFilter (Português)|love.graphics.getDefaultImageFilter]]

source: glyphs
pt_br: glifos

source: local dir = "" --assuming that our path is full of lovely files (it should at least contain main.lua in this case) local files = love.filesystem.enumerate(dir) for k, file in ipairs(files) do print(k .. ". " .. file) --outputs something like "1. main.lua" end
pt_br: local dir = "" --supondo que nosso caminho esteja cheio de arquivos do LÖVE (neste caso, deve conter pelo menos o main.lua) local arquivos = love.filesystem.enumerate(dir) for k, arquivo in ipairs(arquivos) do print(k .. ". " .. arquivo) --imprime algo como "1. main.lua" end

source: Aligning does not work as one might expect! It doesn't align to the x/y coordinates given, but in a rectangle, where the limit is the width.
pt_br: O alinhamento não funciona como alguns esperariam! Ele não se limita por coordenadas x/y, mas dentro de um retângulo, e o limite é a largura.

source: The file or directory to remove.
pt_br: O arquivo ou diretório que será removido.

source: Gets the active color components used when drawing.
pt_br: Obtém os componentes de cor ativos usados ao desenhar.

source: The color of the pixel.
pt_br: A cor do pixel.

source: The root folder of the game's ''save directory''.
pt_br: A pasta raiz do "diretório de escrita" do jogo.

source: * [[love.graphics.setColor]]
pt_br: * [[love.graphics.setColor (Português)|love.graphics.setColor]]

source: ux, uy, uz
pt_br: sx, sy, sz

source: * [[love.graphics.getColorMode]]
pt_br: * [[love.graphics.getColorMode (Português)|love.graphics.getColorMode]]

source: segments (10)
pt_br: segmentos (10)

source: The format to interpret the image's data as.
pt_br: O formato segundo o qual o dado da imagem deve ser interpretado.

source: The Font object to use.
pt_br: O objeto Fonte a ser usado.

source: The current line style.
pt_br: O estilo de linha atual.

source: Draws a circle.
pt_br: Desenha um círculo.

source: Sets or disables scissor.
pt_br: Configura ou desativa o recorte.

source: Remarks
pt_br: Limitações

source: The top-left position along the x-axis.
pt_br: A posição superior esquerda ao longo do eixo x.

source: The alignment.
pt_br: O alinhamento.

source: fused = love.filesystem.isFused( )
pt_br: fundido = love.filesystem.isFused( )

source: This function is not supported in that and later versions. Use [[love.graphics.polygon]] instead.
pt_br: Esta função não é suportada nessa versão e posteriores. Em vez disso, use [[love.graphics.polygon (Português)|love.graphics.polygon]]

source: The position to draw the object (x-axis).
pt_br: A posição em que o objeto será desenhado (eixo x).

source: An Image object which can be drawn on screen.
pt_br: Um objeto Imagem que pode ser desenhado na tela.

source: If you want to continue your game if the file is not valid (for example if you expect it to be written by users), you can protect the calling of the chunk with pcall :
pt_br: Para continuar o jogo se o arquivo não for válido (por exemplo se ele for escrito pelo usuário) você pode proteger a chamada do bloco com pcall :

source: Drawing to a canvas
pt_br: Desenhar em uma pintura

source: join = love.graphics.getLineJoin( )
pt_br: juncao = love.graphics.getLineJoin( )

source: Drawing two masked triangles with different colors
pt_br: Desenhar dois triângulos mascarados com cores diferentes

source: data, err = love.filesystem.newFileData( filepath )
pt_br: dado, erro = love.filesystem.newFileData( caminhoDeArquivo )

source: (except for the get*Directory() calls)
pt_br: (Exceto para as chamadas de get*Directory())

source: The LineStyle to use.
pt_br: O EstiloDeLinha a ser usado.

source: Sets the distance attenuation model.
pt_br: Define o modelo de atenuação por distância.

source: The position of third point on the x-axis.
pt_br: A posição do terceiro ponto no eixo x.

source: files
pt_br: arquivos

source: The error string if an error occurred.
pt_br: O string de erro, caso tenha ocorrido um erro.

source: Creates a new GlyphData.
pt_br: Cria um novo DadoDeGlifo.

source: * [[ love.audio]]
pt_br: * [[ love.audio (Português)|love.audio]]

source: Set an already-loaded Font as the current font.
pt_br: Configura uma Fonte já carregada como a fonte atual.

source: When this function is called with two numbers, dx, and dy, all the following drawing operations take effect as if their x and y coordinates were x+dx and y+dy.
pt_br: Quando esta função é chamada com dois números, dx e dy, todas as operações de desenho seguintes funcionam como se suas coordenadas x e y fossem x+dx e y+dy.

source: Drawing Pacman
pt_br: Desenhado o Pacman

source: The vertices of the polygon.
pt_br: Os vértices do polígono.

source: The passed function draws to the stencil instead of the screen, creating an image with transparent and opaque pixels.
pt_br: A função passada desenha no estêncil em vez de na tela, criando uma imagem com pixels transparentes e opacos.

source: * [[love.graphics.setShader]]
pt_br: * [[love.graphics.setShader (Português)|love.graphics.setShader]]

source: The currently active Shader, or [[nil]] if none is set.
pt_br: O Shader ativo atual, ou [[nil (Português)|nil]] se nenhum tiver sido definido.

source: BlendMode
pt_br: ModoDeMistura

source: anisotropy
pt_br: anisotropia

source: myStencilFunction = function() love.graphics.circle("fill", 400, 300, 50) end love.graphics.setInvertedStencil(myStencilFunction) love.graphics.circle("fill", 400, 300, 150)
pt_br: minhaFuncaoEstencil = function() love.graphics.circle("fill", 400, 300, 50) end love.graphics.setInvertedStencil(minhaFuncaoEstencil) love.graphics.circle("fill", 400, 300, 150)

source: The radius of the circle.
pt_br: O raio do círculo.

source: Defines an inverted stencil for the drawing operations or releases the active one.
pt_br: Define um estêncil invertido para operações de desenho, ou libera o estêncil ativo.

source: Load SoundData and create a Source
pt_br: Carregar DadoDeSom e criar uma Fonte

source: Initializes love.filesystem, will be called internally, so should not be used explictly.
pt_br: Inicializa o módulo love.filesystem, será chamada internamente, por isso não deve ser chamado explicitamente.

source: img = love.graphics.newImage("mushroom-64x64.png") -- Let's say we want to display only the top-left -- 32x32 quadrant of the Image: top_left = love.graphics.newQuad(0, 0, 32, 32, img:getDimensions()) -- And here is bottom left: bottom_left = love.graphics.newQuad(0, 32, 32, 32, img:getDimensions()) function love.draw() love.graphics.draw(img, top_left, 50, 50) love.graphics.draw(img, bottom_left, 50, 200) -- v0.8: -- love.graphics.drawq(img, top_left, 50, 50) -- love.graphics.drawq(img, bottom_left, 50, 200) end
pt_br: img = love.graphics.newImage("cogumelo-64x64.png") -- Digamos que queiramos mostrar somente o quadrante -- 32x32 superior esquerdo da Imagem: superior_esquerdo = love.graphics.newQuad(0, 0, 32, 32, img:getDimensions()) -- E aqui o quadrante inferior esquerdo: inferior_esquerdo = love.graphics.newQuad(0, 32, 32, 32, img:getDimensions()) function love.draw() love.graphics.draw(img, superior_esquerdo, 50, 50) love.graphics.draw(img, inferior_esquerdo, 50, 200) -- v0.8: -- love.graphics.drawq(img, superior_esquerdo, 50, 50) -- love.graphics.drawq(img, inferior_esquerdo, 50, 200) end

source: The 16-bit stipple pattern.
pt_br: O padrão de pontilhado (em 16-bit).

source: function CreateCircle(segments) segments = segments or 40 local vertices = {} -- The first vertex is at the origin (0, 0) and will be the center of the circle. table.insert(vertices, {0, 0}) -- Create the vertices at the edge of the circle. for i=0, segments do local angle = (i / segments) * math.pi * 2 -- Unit-circle. local x = math.cos(angle) local y = math.sin(angle) table.insert(vertices, {x, y}) end -- The "fan" draw mode is perfect for our circle. We aren't texturing it, so we leave that argument as nil. return love.graphics.newMesh(vertices, nil, "fan") end function love.load() mesh = CreateCircle() end function love.draw() local radius = 100 local mx, my = love.mouse.getPosition() -- We created a unit-circle, so we can use the scale parameter for the radius directly. love.graphics.draw(mesh, mx, my, 0, radius, radius) end
pt_br: function CriarCirculo(segmentos) segmentos = segmentos or 40 local vertices = {} -- O primeiro vértice fica na origem (0, 0) e será o centro do círculo. table.insert(vertices, {0, 0}) -- Cria os vértices na borda do círculo. for i=0, segmentos do local angulo = (i / segmentos) * math.pi * 2 -- Círculo unitário. local x = math.cos(angulo) local y = math.sin(angulo) table.insert(vertices, {x, y}) end -- O modo de desenho "fan" (leque) é perfeito para o nosso círculo. Não vamos texturizá-lo, então deixamos esse argumento como nil. return love.graphics.newMesh(vertices, nil, "fan") end function love.load() malha = CriarCirculo() end function love.draw() local raio = 100 local mx, my = love.mouse.getPosition() -- Criamos um círculo unitário, então podemos usar o parâmetro de escala diretamente como raio. love.graphics.draw(malha, mx, my, 0, raio, raio) end

source: It presents all the results of your drawing operations on the screen.
pt_br: Ela apresenta todos os resultados das suas operações de desenho na tela.

source: The current Font. Automatically creates and sets the default font, if none is set yet.
pt_br: A Fonte atual. Cria e define automaticamente a fonte padrão, se nenhuma tiver sido definida.

source: Disables shaders, allowing unfiltered drawing operations.
pt_br: Desativa shaders, permitindo operações de desenho sem filtro.

source: The string data to append to the file.
pt_br: O string de dado a acrescentar ao arquivo.

source: The position of top-left corner along y-axis.
pt_br: A posição do canto superior esquerdo ao longo do eixo y.

source: It has been renamed to [[love.filesystem.createDirectory]]
pt_br: Foi renomeado para [[love.filesystem.createDirectory (Português)|love.filesystem.createDirectory]]

source: Object Creation
pt_br: Criação de Objetos

source: PointStyle
pt_br: EstiloDePonto

source: Gets the full path to the designated save directory.
pt_br: Obtém o caminho completo do diretório de escrita designado.

source: The last modification time in seconds since the unix epoch or nil on failure.
pt_br: A hora da última modificação em segundos desde a época do unix, ou nil, se falhar.

source: Rasterizer
pt_br: Rasterizador

source: The position of the vertex on the y-axis.
pt_br: A posição do vértice no eixo y.

source: Nothing
pt_br: Nada

source: Defines or releases a stencil for the drawing operations.
pt_br: Define ou retira um estêncil para as operações de desenho.

source: The loaded chunk
pt_br: O bloco carregado

source: Creates a new [[FileData]] object.
pt_br: Cria um novo objeto [[FileData (Português)|DadoDeArquivo]].

source: This function can only be called once, and is normally automatically done by LÖVE.
pt_br: Essa função só pode ser chamada uma única vez, e o normal é que isso seja feito automaticamente pelo LÖVE.

source: Recursively find and display all files and folders in a folder and its subfolders.
pt_br: Encontrar recursivamente e exibir todos arquivos e pastas em uma pasta e suas subpastas.

source: love.graphics.draw( drawable, x, y, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.draw( desenhavel, x, y, r, ex, ey, ox, oy, ix, iy )

source: canvas = love.graphics.newCanvas( width, height, format, fsaa )
pt_br: pintura = love.graphics.newCanvas( largura, altura, formato, fsaa )

source: y coordinate of upper left corner.
pt_br: A coordenada y do canto superior esquerdo.

source: Access the pre-transformed vertex position in the pixel shader with the varying keyword.
pt_br: Acessar a posição de vértice pré-transformada no shader de pixel com a palavra-chave varying (variante).

source: The right and bottom edges of the object are shifted at an angle defined by the shearing factors.
pt_br: Os limites da direita e debaixo do objeto são deslocados num ângulo definido pelos fatores de inclinação.

source: The current number of simultaneously playing sources.
pt_br: O número de fontes tocando atualmente.

source: love.graphics.setPointSize( size )
pt_br: love.graphics.setPointSize( tamanho )

source: file
pt_br: arquivo

source: Remember, the translation is reset at the end of each [[love.draw]].
pt_br: Lembre-se, a translação é reiniciada ao fim de cada [[love.draw (Português)|love.draw]].

source: Translates the coordinate system in two dimensions.
pt_br: Translada o sistema de coordenadas em duas dimensões.

source: It is possible to define new events by appending the table love.handlers.
pt_br: É possível definir novos eventos adicionando-os à tabela love.handlers.

source: * [[love.graphics.push]]
pt_br: * [[love.graphics.push (Português)|love.graphics.push]]

source: * [[love.graphics.newFont]]
pt_br: * [[love.graphics.newFont (Português)|love.graphics.newFont]]

source: Gets the current [[love.graphics.setPoint|point]] style.
pt_br: Obtém o estilo de [[love.graphics.setPoint (Português)|ponto]] atual.

source: file = love.filesystem.newFile("data.txt") file:open("r") data = file:read()
pt_br: arquivo = love.filesystem.newFile("dados.txt") arquivo:open("r") dados = arquivo:read()

source: Creates a new [[Shader]].
pt_br: Cria um novo [[Shader (Português)|Shader]].

source: A stipple pattern is made up of a 16bit sequence of 0s and 1s, Just like binary.
pt_br: Um padrão de pontilhado é composto por uma sequência de 16 bits de 0s e 1s, igual binário.

source: love.graphics.scale( sx, sy )
pt_br: love.graphics.scale( ex, ey )
